CREATE DATABASE  IF NOT EXISTS `project` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `project`;
-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: project
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `buy`
--

DROP TABLE IF EXISTS `buy`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `buy` (
  `PK` int NOT NULL AUTO_INCREMENT,
  `pid` varchar(45) NOT NULL,
  `email` varchar(45) NOT NULL,
  `product_name` varchar(45) NOT NULL,
  `product_price` varchar(45) NOT NULL,
  `buycol` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`PK`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `buy`
--

LOCK TABLES `buy` WRITE;
/*!40000 ALTER TABLE `buy` DISABLE KEYS */;
INSERT INTO `buy` VALUES (1,'1','null','噴火龍','500',NULL),(2,'3','null','九尾','250',NULL),(3,'3','null','九尾','250',NULL),(4,'3','null','九尾','250',NULL),(5,'3','null','九尾','250',NULL),(6,'3','null','九尾','250',NULL),(7,'3','null','九尾','250',NULL),(8,'3','null','九尾','250',NULL),(9,'3','null','九尾','250',NULL),(10,'3','null','九尾','250',NULL),(11,'3','test@gmail.com','九尾','250',NULL),(12,'3','test@gmail.com','九尾','250',NULL),(13,'2','test@gmail.com','風速狗','300',NULL),(14,'6','test@gmail.com','水水獺','50',NULL),(15,'3','test@gmail.com','九尾','250',NULL);
/*!40000 ALTER TABLE `buy` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `guestbook`
--

DROP TABLE IF EXISTS `guestbook`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `guestbook` (
  `GBNO` tinyint NOT NULL AUTO_INCREMENT,
  `Title` varchar(30) DEFAULT NULL,
  `Content` text,
  `Putdate` date DEFAULT NULL,
  `IP` varchar(30) DEFAULT NULL,
  PRIMARY KEY (`GBNO`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `guestbook`
--

LOCK TABLES `guestbook` WRITE;
/*!40000 ALTER TABLE `guestbook` DISABLE KEYS */;
/*!40000 ALTER TABLE `guestbook` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member`
--

DROP TABLE IF EXISTS `member`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member` (
  `mid` int NOT NULL AUTO_INCREMENT,
  `username` text,
  `password` text,
  `name` text,
  `tel` text,
  `addr` text,
  `email` text,
  `gender` text,
  `birth` date DEFAULT NULL,
  `q1` varchar(45) DEFAULT NULL,
  `q2` varchar(45) DEFAULT NULL,
  `passwordch` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`mid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member`
--

LOCK TABLES `member` WRITE;
/*!40000 ALTER TABLE `member` DISABLE KEYS */;
/*!40000 ALTER TABLE `member` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `pid` int NOT NULL,
  `file_path` varchar(45) NOT NULL,
  `product_name` text NOT NULL,
  `product_attritube` varchar(45) NOT NULL,
  `product_region` varchar(45) NOT NULL,
  `product_price` int NOT NULL,
  `normal skill` varchar(45) NOT NULL,
  `special_skill` varchar(45) NOT NULL,
  `num` int NOT NULL,
  `intro1` varchar(100) NOT NULL,
  `intro2` varchar(100) NOT NULL,
  `intro3` varchar(100) NOT NULL,
  `bnum` int NOT NULL,
  PRIMARY KEY (`pid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'image','噴火龍','火/飛','關都',500,'火焰漩渦','爆炸烈焰',1000,'1.會噴出彷彿連岩石都能燒焦的灼熱火焰。有時會引發森林火災。','2.能用翅膀飛到距離地面１４００公尺的高度。會吐出高溫的火焰。','3',0),(2,'image','風速狗','火','關都',300,'火焰牙','大字爆炎',1000,'1.只需要一晝夜時間就能跑完１００００公里的身影令許多人為之沉醉。','2.從古時候起就是擄獲眾多人心的美麗寶可夢。能像飛一樣輕盈地奔跑。','3',0),(3,'image','九尾','火','關都',250,'火焰漩渦','過熱',1000,'1.每一根尾巴裡都蘊含著神通力。據說牠的壽命長達１０００年。','2.聰明伶俐但很會記仇。據說如果敢亂抓牠的尾巴，牠就會纏著你作祟１０００年。','3.擁有金光閃耀的亮麗毛皮。九根長尾蘊藏神聖之力，傳說可以活上千歲之久。',0),(4,'image','暴鯉龍','水','關都',300,'攀瀑','水炮',1000,'1.性情非常凶暴。從嘴裡發出的破壞光線能夠將一切燃燒殆盡。','2.就算是在狂風暴雨中，只要發狂的暴鯉龍出現，一切都會被牠燒毀殆盡。','3.被認為是古書所載之龍的真身。文獻中留有牠口吐熱線，將村落焚燒殆盡的紀錄。',0),(5,'image','波加曼','水','神奧',50,'泡沫','啄鑽',1000,'1.非常討厭被別人照顧。因為不肯聽訓練家的指示，要和牠變得親密是很困難的。','2.自尊心很強，討厭從人那裡接受食物。長長的絨毛能抵禦寒冷。','3.喜愛寒冷，會出現在海邊。外表如孩童般可愛，但心高氣傲，不願接受來自人類的施捨。',0),(6,'image','水水獺','水','合眾',50,'水槍','水流尾',1000,'1.長在腹部的扇貝貝不僅可在戰鬥中使用，要敲開堅硬樹果時也能派上用場。','2.用腹部的扇貝貝戰鬥。擋住攻擊後，能迅速地斬切對手反擊。','3.棲息在合眾地區的寶可夢。會將腹部貝殼作為兵刃斬擊敵手，因而吾人將此貝殼命名為扇貝貝刀。',0),(7,'image','甲賀忍蛙','水/惡','卡洛斯',800,'泡沫','水炮',1000,'1.將水壓縮，做出手裡劍。高速旋轉射出的手裡劍，就連金屬也能一分為二。','2.如忍者般神出鬼沒。以敏捷的動作戲弄對手，再用水之手裡劍將其劈裂。','3',0),(8,'image','草苗龜','草','關都',50,'飛葉快刀','種子炸彈',1000,'1.沐浴著陽光，用全身進行光合作用。甲殼是泥土變硬後形成的。','2.用全身進行光合作用，製造氧氣。當口渴的時候，頭上的葉子就會枯萎。','3.陽光越是照耀，活力越是充沛。形似甲殼的部分質地近似泥沙，觸感濕潤且帶有微溫',0),(9,'image','藤藤蛇','草','合眾',50,'藤鞭','種子炸彈',1000,'1.只要沐浴在陽光下，動作就會變得比平常更加迅速。用起藤蔓時比用手更加靈活。','2.用尾巴吸收太陽光，進行光合作用。沒精神的時候尾巴會垂下。','3',0),(10,'image','皮卡丘','雷','關都',150,'電擊','瘋狂伏特',1000,'1.越是能製造出強大電流的皮卡丘，臉頰上的囊就越柔軟，同時也越有伸展性。','2.皮卡丘們把尾巴貼在一起交換電流，其實是在互相打招呼。','3.雙頰有囊，用以積蓄電力。棲息在森林，性情聰慧，會以電擊燒灼堅硬的樹果食用。',0),(11,'image','正負電拍拍','雷','豐緣',100,'電光','十萬伏特',1000,'1.為夥伴加油的時候，會從全身發出電火花並劈哩啪啦地發光。如果夥伴輸了就會放聲大哭。','2.總是在為夥伴加油的寶可夢。當夥伴努力加油的時候，牠會讓身體短路，發出劈哩啪啦的火花聲來表達自己的喜悅。','3',0),(12,'image','電飛鼠','雷/飛行','合眾',200,'電擊','放電',1000,'1.蓄著電在空中飛行。在雷電交加的深夜裡，牠們甚至會密密麻麻地佈滿整個天空。','2.會一邊到處放電一邊飛行，所以鳥寶可夢們不會靠近牠，這讓牠可以獨佔食物。','3',0),(13,'image','鐵掌力士','格鬥','豐緣',450,'雙倍奉還','爆裂拳',1000,'1.雖然喜歡和對手比力氣，但心地善良且注重禮儀，會慰勞與自己對戰的對手。','2.體型壯碩的鐵掌力士未必就很強。也有體型雖小，但身輕如燕且技巧高超的鐵掌力士存在。','3',0),(14,'image','路卡利歐','格鬥/鋼','神奧',1000,'雙倍奉還','波導彈',1000,'1.操作一種被稱為波導的力量來進行狩獵。這種力量就連巨大的岩石也能擊得粉碎。','2.牠能理解人類的想法，因此只會去親近內心端正的訓練家。','3.容貌威風凜凜。能發出氣之波動並自在加以引導，藉以探知遠處對手的虛實。吾人將此種能力命名為波導。',0),(15,'image','師父鼬','格鬥','關都',350,'踢倒','打草結',1000,'1.會用連續攻擊壓倒對手。致命的一擊會在緩慢蓄力之後施展出來。','2.當牠用奇妙聲音發出叫喊時是很危險的，由快到無法看清的踢腿和手刀組成的連續攻擊將接踵而來。','3',0),(16,'image','快拳郎','格鬥','關都',107,'雙倍奉還','近身戰',1000,'1.使出的拳擊能劈開空氣。出拳的速度極為迅速，即便只是擦過都會造成灼傷。','2.打出的拳擊甚至能劈開空氣。但連續攻擊３分鐘後，牠似乎就會想休息一下。','3',0),(17,'image','請假王','一般','豐緣',1250,'哈欠','破壞光線',1000,'1.整天躺著生活的寶可夢。會吃伸手能及的地方長出來的草，如果草吃光了，就會很不情願地換個地方。','2.刻在草原上半徑１公尺的圓圈，是請假王躺在地上吃光了身邊的草之後形成的。','3',0),(18,'image','百變怪','一般','關都',600,'變身','掙扎',1000,'1.能夠藉由重組全身的細胞，變得與看到的東西一模一樣，然而一旦放鬆就會變回原形。','2.當兩隻百變怪相遇的時候，為了能變成和對方相同的樣子，牠們動起來會比平常更加劇烈。','3',0),(19,'image','卡比獸','一般','關都',750,'舌舔','破壞光線',1000,'1.每天不吃下４００公斤的食物絕不會善罷甘休。吃飽了就會開始睡覺。','2.擁有一個結實的胃，即使吃了發霉腐爛的東西，也完全不會吃壞肚子。','3.這個大胃王會突然出現在村莊裡，並在轉眼間將米倉一掃而空。此種行為自古被視為天災的一種。',0),(20,'image','袋獸','一般','關都',700,'關都','逆麟',1000,'把自己的孩子放進腹部的袋子裡保護，會毫不留情地狠狠教訓傷害自己 孩子的傢伙。','絕對不要靠近從袋獸腹中溜出來玩耍的孩子，因為母親正在某處守護著牠。','3',0),(21,'image','吉利蛋','一般','關都',400,'意念頭錘','破壞光線',1000,'1.因為其他寶可夢盯上了牠營養又美味的蛋，牠的腳程似乎在逃跑的過程中變快了。','2.由於曾有過以奪取牠腹部的蛋為目的而加以濫捕的歷史，所以牠的數量非常稀少','3.心性善良，會將蛋分給傷者。此蛋營養豐富且滋味鮮美，有著不求醫的別名。',0),(22,'image','幸福蛋','一般','城都',500,'意念頭錘','魔法閃耀',1000,'1.牠的蛋美味至極，甚至有吃了就能獲得幸福的說法，所以在市場上的價格是最高的。','2.心中充滿了愛的寶可夢。據說只有和訓練家心靈相通的吉利蛋才能進化。','3.富有同情心，會照顧患病的人或寶可夢直至對方痊癒。所生的蛋滋味絕佳，能為吃下的人帶來幸福。',0),(23,'image','快龍','飛行/龍','關都',1000,'龍尾','流星群',1000,'1.能輕描淡寫地飛越驚濤駭浪，目睹這個景象的船長稱呼牠為大海的化身。','2.心地善良的寶可夢。經常能聽見牠在海上救了溺水的人或寶可夢的消息。','3.',0),(24,'image','暴飛龍','飛行/龍','豐緣',1250,'龍尾','流星群',1000,'1.因為終於能飛的喜悅而不斷在天空四處翱翔。在耗盡體力而入睡之前，幾乎不會降落。','2.在不斷地強烈祈求之下，身體的細胞發生了突變，讓牠得到了夢寐以求的翅膀。','3',0),(25,'image','大比鳥','飛行','關都',350,'空氣斬','勇鳥猛攻',1000,'1.有著亮麗羽毛的寶可夢。有許多訓練家被大比鳥頭上美麗的羽毛深深吸引而開始培育牠。','2','3',0),(26,'image','化石翼龍','飛行','關都',550,'落石','岩崩',1000,'1.由琥珀中殘留的基因還原而來。性情比想像中更加兇暴，甚至還出現了犧牲者。','2.以高高在上的姿態翱翔在古代的天空中。一旦降落到地面就會變得很弱，連走路也很慢','3',0),(27,'image','謎擬Q','幽靈','阿羅拉',600,'劍舞','影子偷襲',1000,'1.為了讓別人不要害怕自己，特意穿上了看似皮卡丘的破布，結果卻變得更加令人毛骨悚然。','2.有一位學者為了研究而看了牠的破布裡面，結果患上怪病而離開人世。','3',0),(28,'image','耿鬼','幽靈','關都',750,'禍不單行','暗影球',1000,'1.滿月的夜晚，如果影子自己動起來並露出笑容，那肯定是耿鬼搞的鬼。','2.據說牠會為了奪取山中遇難者的生命而從黑暗中出現。','3.附在影子裡伺機取人性命的寶可夢。要是發現腳下的影子自己在笑，最好趕緊握住護身符來驅邪。',0),(29,'image','夢妖','幽靈','城都',150,'禍不單行','惡之波動',1000,'1.把嚇唬別人當成自己活著的意義。如果把耳朵貼近牠脖子上的紅珠子，就會聽見裡頭傳來哀嚎的聲音。','2.會藉由模仿人哭叫的聲音嚇唬大家來取樂。不擅長應付膽大的對手。','3.潛藏於暗處，發出幼兒般的啜泣聲令旅人聽之膽寒。當牠以人們恐懼的模樣取樂時，胸口的紅珠會發出妖異的光輝。',0),(30,'image','燭光靈','幽靈/火','合眾',30,'驚嚇','烈焰濺射',1000,'1.頭上燃燒著的燭光讓牠的身體保持微熱。會拉著迷路孩子的手，將他們帶向靈界。','2.吸取到的靈魂越年輕，頭上的燭光就會燃燒得越旺越詭異。','3',0),(31,'image','水伊布','水','關都',250,'水槍','水流尾',1000,'1.當水伊布開始微微顫動牠全身上下的鰭，就表示幾個小時之後要下雨了。','2.身體細胞的結構與水分子相似。牠能和水融為一體，讓別人無法看見牠。','3.從牠身上可檢出酷似水分子的細胞。吾人推測這就是牠潛水時得以隱身的原因，而這也是人魚傳說的真相。',0),(32,'image','火伊布','火/伊布','關都',250,'火焰旋渦','過熱',1000,'1.當火焰在體內積蓄時，火伊布的體溫也會隨之上升到最高９００度。','2.會將吸入的空氣的一部分傳送到自己體內的火囊裡，製造出１７００度的火焰。','3.囊狀的內臟中燃燒著火焰。能藉吸入空氣強化其火力，溫度甚至可達１７００度之高。',0),(33,'image','雷伊布','雷','關都',250,'伏特替換','十萬伏特',1000,'1.當雷伊布生氣或是吃驚時，牠全身的體毛會像針一樣豎起來刺穿對手。','2.有時會吸入空氣中的負離子，吐出大約１００００伏特的高壓電。','3.發怒時體毛會像銳利的針般倒豎。氣息吞吐之間可以聽見啪啪作響的電流聲',0),(34,'image','太陽伊布','超能','城都',450,'念力','精神強念',1000,'1.能透過感受空氣的流動，準確地預測出接下來的天氣和對手的行動等等。','2.從額頭的珠子放射出精神力量進行戰鬥。當力量用盡時，珠子的顏色也會褪去。','3.能夠發揮不可思議的力量，預測天候及人心。當沐浴在日光下時，額上紅珠會發亮，令牠活力大增。',0),(35,'image','月亮伊布','惡','城都',450,'大聲咆哮','欺詐',1000,'1.發怒的時候會從全身的毛孔裡噴出混合了毒素的汗液，瞄準對手的眼睛發動攻擊。','2.在滿月之夜或是興奮的時候，牠身上圈圈一樣的花紋就會發出金黃色的光。','3.活躍於月光灑落大地的夜半時分。大大的眼睛即使是在黑暗之中也能牢牢捕捉獵物的身影。',0),(36,'image','葉伊布','草','神奧',350,'飛葉快刀','日光束',1000,'1.伽勒爾人對牠的葉片散發出的獨特香氣情有獨鍾。用這種香氣加工出的香水非常受歡迎。','2.尾巴如同銳利的刀刃，鋒利得無與倫比，連大樹都能一刀兩斷。','3.從體毛中可檢出近似植物的細胞。堅硬的尾部能將大樹一刀兩斷，鋒利程度更勝名刀一籌。',0),(37,'image','冰伊布','冰','神奧',350,'冰息','雪崩',1000,'1.能夠降下冰晶。被牠的美貌迷住的獵物會在不知不覺間被凍住。','2.冰伊布釋放出的冷氣能製造出粉狀的雪。這使牠受到各個滑雪場的熱烈歡迎。','3.擁有急速降低體熱的能力。能凍結大氣，引發細碎冰晶如同寶石般閃耀飛舞的現象。',0),(38,'image','仙子伊布','妖精','卡洛斯',550,'撒嬌','魔法閃耀',1000,'1.會從蝴蝶結般的觸角裡釋放能夠消除敵意的波動，藉此平息紛爭。','2.伽勒爾地區的童話中有著美麗的仙子伊布擊退了可怕的龍寶可夢的故事。','3.擁有急速降低體熱的能力。能凍結大氣，引發細碎冰晶如同寶石般閃耀飛舞的現象。',0),(39,'image','捷克羅姆','龍/電','合眾',3000,'龍息','瘋狂伏特',1000,'1.能以閃電將世界燃燒殆盡的傳說的寶可夢。會輔助創造理想世界的人。','2.用尾巴製造電能。將全身藏在雷雲裡，在合眾地區的上空飛行。','3',0),(40,'image','阿爾宙斯','一般','無地區',8000,'暗影爪','破壞光線',1000,'1.神奧神話裡描述牠從蛋裡出現，並創造了整個世界。','2.神話裡描述牠是在宇宙還不存在時就誕生的最早的寶可夢。','3.以己身為光源，從天照耀洗翠大地。憑藉其光明引導並守護寶可夢。洗翠神話視其為萬物的創造主。',0),(41,'image','超夢','超能','關都',5000,'念力','精神強念',1000,'1.透過操作基因製造出的寶可夢。人類的科技可以造出牠的身體，卻無法造出一顆溫柔的心','2','3',0),(42,'image','烈空座','飛行/龍','豐緣',5000,'龍尾','逆麟',1000,'1.據說已經生存了數億年。世上留存著牠調解了固拉多與蓋歐卡之間爭鬥的傳說','2.不斷在臭氧層飛行，吞食隕石作為食物。用儲存在體內的隕石能量來超級進化。','3',0),(43,'image','洛奇亞','超能/飛行','城都',2500,'神通力','神鳥猛擊',1000,'1.有著只要輕輕揮動翅膀就能吹走房屋的破壞力，因此躲在不為人知的海底生活。','2','3',0);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-06 19:39:57
